{
 "map": {
  "verb": {
   "attach": 2,
   "detach": 3,
   "position": 4
  },
  "this": {
   "arm": 2,
   "arm connector": 3,
   "back seat": 4,
   "base": 5,
   "basket": 6,
   "battery": 7,
   "blade": 8,
   "body": 9,
   "boom": 10,
   "bucket": 11,
   "bulldozer arm": 12,
   "bumper": 13,
   "cabin": 14,
   "cabin window": 15,
   "chassis": 16,
   "clamp": 17,
   "connector": 18,
   "container": 19,
   "crane arm": 20,
   "cylinder": 21,
   "dashboard": 22,
   "door": 23,
   "dump bed": 24,
   "engine": 25,
   "engine cover": 26,
   "excavator arm": 27,
   "figurine": 28,
   "fire equipment": 29,
   "fire extinguisher": 30,
   "grill": 31,
   "hook": 32,
   "interior": 33,
   "jackhammer": 34,
   "ladder": 35,
   "ladder basket": 36,
   "lid": 37,
   "light": 38,
   "mixer": 39,
   "mixer stand": 40,
   "nut": 41,
   "push frame": 42,
   "rear body": 43,
   "rear bumper": 44,
   "rear roof": 45,
   "rocker panel": 46,
   "roller": 47,
   "roller arm": 48,
   "roof": 49,
   "side ladder": 50,
   "sound module": 51,
   "spoiler": 52,
   "step": 53,
   "strap": 54,
   "tilter": 55,
   "track": 56,
   "transport cabin": 57,
   "turntable base": 58,
   "turntable top": 59,
   "water tank": 60,
   "wheel": 61,
   "windshield": 62
  },
  "that": {
   "arm": 2,
   "arm connector": 3,
   "base": 4,
   "body": 5,
   "boom": 6,
   "bucket": 7,
   "bulldozer arm": 8,
   "bumper": 9,
   "cabin": 10,
   "cabin window": 11,
   "chassis": 12,
   "clamp": 13,
   "container": 14,
   "dump bed": 15,
   "dumpbed": 16,
   "engine": 17,
   "excavator arm": 18,
   "grill": 19,
   "interior": 20,
   "ladder": 21,
   "mixer": 22,
   "mixer stand": 23,
   "nut": 24,
   "push frame": 25,
   "rear body": 26,
   "roller": 27,
   "roof": 28,
   "tilter": 29,
   "track": 30,
   "transport cabin": 31,
   "turntable base": 32,
   "turntable top": 33,
   "water tank": 34,
   "wheel": 35
  },
  "toy": {
   "a02": 2,
   "a03": 3,
   "a06": 4,
   "a07": 5,
   "a08": 6,
   "a09": 7,
   "a11": 8,
   "a13": 9,
   "a14": 10,
   "a15": 11,
   "a16": 12,
   "a17": 13,
   "a18": 14,
   "a19": 15,
   "a20": 16,
   "a21": 17,
   "a23": 18,
   "a24": 19,
   "a26": 20,
   "a27": 21,
   "a28": 22,
   "a29": 23,
   "a30": 24,
   "a31": 25,
   "b01a": 26,
   "b01b": 27,
   "b02a": 28,
   "b02b": 29,
   "b03a": 30,
   "b03b": 31,
   "b04a": 32,
   "b04b": 33,
   "b04c": 34,
   "b04d": 35,
   "b05a": 36,
   "b05b": 37,
   "b05c": 38,
   "b05d": 39,
   "b06a": 40,
   "b06b": 41,
   "b06c": 42,
   "b06d": 43,
   "b08a": 44,
   "b08b": 45,
   "b08c": 46,
   "b08d": 47,
   "c01a": 48,
   "c01b": 49,
   "c01c": 50,
   "c01d": 51,
   "c02a": 52,
   "c02b": 53,
   "c02c": 54,
   "c03a": 55,
   "c03b": 56,
   "c03c": 57,
   "c03d": 58,
   "c03e": 59,
   "c04a": 60,
   "c04b": 61,
   "c04c": 62,
   "c04d": 63,
   "c05a": 64,
   "c06a": 65,
   "c06b": 66,
   "c06d": 67,
   "c06e": 68,
   "c06f": 69,
   "c07a": 70,
   "c07b": 71,
   "c07c": 72,
   "c08a": 73,
   "c08b": 74,
   "c08c": 75,
   "c09a": 76,
   "c09b": 77,
   "c09c": 78,
   "c10a": 79,
   "c10b": 80,
   "c10c": 81,
   "c11a": 82,
   "c11b": 83,
   "c12a": 84,
   "c12b": 85,
   "c12c": 86,
   "c12d": 87,
   "c12e": 88,
   "c13a": 89,
   "c13b": 90,
   "c13d": 91,
   "c13e": 92,
   "c13f": 93,
   "c14a": 94,
   "c14b": 95
  }
 },
 "sizes": {
  "verb": 5,
  "this": 63,
  "that": 36,
  "toy": 96
 }
}